# Brewfile - Homebrew package# Applications (Casks)
cask "orbstack"            # Docker Desktop alternative
cask "powershell"          # PowerShell for macOS
cask "visual-studio-code"  # Code editor
cask "1password"           # Password manager
cask "appcleaner"          # Uninstaller that removes all app files
cask "cleanshot"           # Screenshot and screen recording tool
cask "chatgpt"             # ChatGPT desktop client
cask "raindrop"            # Bookmark manager

# Microsoft Apps (install in this order for proper setup)
cask "microsoft-auto-update"  # Required for Microsoft apps
cask "microsoft-teams"        # Microsoft Teams
cask "company-portal"         # Intune Company Portal

# Mac App Store Applications (requires 'mas' and signed into App Store)
# To find app IDs: mas search "app name"
# Note: Microsoft Office apps are not available via mas CLI
# Install Microsoft Office apps manually from the Mac App Store or use the casks below
mas "Windows App", id: 1295203466  # Microsoft Remote Desktop
mas "Day One", id: 1055511498      # Journaling app
mas "1Password for Safari", id: 1569813296  # Safari extension for 1Password
mas "Screens 5", id: 1663047912    # VNC client for remote desktopstall with: brew bundle --file=~/Developer/dotfiles/Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Note: homebrew/cask-fonts is deprecated - fonts are now in homebrew/cask

# CLI Tools
brew "azure-cli"           # Azure command-line interface
brew "gh"                  # GitHub CLI
brew "git"                 # Version control
brew "terraform"           # Infrastructure as Code
brew "tflint"              # Terraform linter
brew "jq"                  # JSON processor
brew "yq"                  # YAML processor
brew "wget"                # Download utility
brew "curl"                # HTTP client
brew "mas"                 # Mac App Store CLI
# brew "tree"                # Directory tree viewer
# brew "htop"                # System monitor
# brew "fzf"                 # Fuzzy finder
# brew "ripgrep"             # Fast grep alternative
# brew "bat"                 # Better cat with syntax highlighting
# brew "exa"                 # Better ls with colors and icons
# brew "fd"                  # Better find
# brew "tldr"                # Simplified man pages
# brew "zoxide"              # Smart cd replacement

# Applications (Casks)
cask "orbstack"            # Docker Desktop alternative
cask "powershell"          # PowerShell for macOS
cask "visual-studio-code"  # Code editor
cask "1password"           # Password manager
cask "appcleaner"          # Uninstaller that removes all app files
cask "cleanshot"           # Screenshot and screen recording tool
cask "chatgpt"             # ChatGPT desktop client
cask "raindrop"            # Bookmark manager

# Microsoft Apps (install in this order for proper setup)
cask "microsoft-auto-update"  # Required for Microsoft apps
cask "company-portal"         # Intune Company Portal
cask "microsoft-teams"        # Microsoft Teams

# Mac App Store Applications (requires 'mas' and signed into App Store)
# To find app IDs: mas search "app name"
# Note: Microsoft Office apps are not available via mas CLI
# Install Microsoft Office apps manually from the Mac App Store or use Company Portal
mas "Windows App", id: 1295203466  # Microsoft Remote Desktop
mas "Day One", id: 1055511498      # Journaling app
mas "1Password for Safari", id: 1569813296  # Safari extension for 1Password
mas "Screens 5", id: 1663047912    # VNC client for remote desktop

# Optional: Fonts
# Note: homebrew/cask-fonts tap was deprecated, fonts are now in homebrew/cask
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"


